; domain
; source: https://github.com/AI-Planning/pddl-generators/blob/main/transport/domain.pddl
; updates:
;  - removed :action-costs and :functions
;  - capacity type now is size
;  - capacity-number predicate now is capacity
(define (domain transport)
  (:requirements :typing)
  (:types
        size location locatable - object
        vehicle package - locatable
  )

  (:predicates
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - size)
     (capacity-predecessor ?s1 ?s2 - size)
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
      )
  )

 (:action pickup
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - size)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - size)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
      )
  )

)

; problem
(define (problem transport-48)
 (:domain transport)
 (:objects 
    v1 - vehicle
    p1 p2 p3 p4 p5 p6 p7 p8 - package
    l1 l2 l3 l4 l5 l6 l7 l8 l9 l10 - location
    c0 c1 c2 - size
    )
 (:init
    (capacity v1 c1)
    (capacity-predecessor c0 c1)
    (capacity-predecessor c1 c2)
    (at p1 l3)
    (at p2 l7)
    (at p3 l6)
    (at p4 l4)
    (at p5 l5)
    (at p6 l6)
    (at p7 l2)
    (at p8 l10)
    (at v1 l3)
    (road l6 l2)
    (road l3 l8)
    (road l5 l4)
    (road l4 l6)
    (road l6 l4)
    (road l9 l2)
    (road l1 l4)
    (road l6 l7)
    (road l2 l9)
    (road l7 l6)
    (road l2 l6)
    (road l10 l6)
    (road l6 l10)
    (road l4 l5)
    (road l8 l3)
    (road l8 l2)
    (road l4 l1)
    (road l2 l8)
    (road l3 l5)
    (road l5 l3)
    (road l7 l10)
    (road l10 l7)
    (road l1 l9)
    (road l9 l1)
    (road l1 l10)
    (road l10 l1)
    (road l1 l3)
    (road l3 l1)
    (road l1 l5)
    (road l5 l1)
    (road l7 l8)
    (road l8 l7)
    (road l5 l10)
    (road l10 l5)
    (road l3 l4)
    (road l4 l3)
    (road l2 l7)
    (road l7 l2)
    (road l1 l7)
    (road l7 l1)
    (road l4 l8)
    (road l8 l4)
    (road l2 l3)
    (road l3 l2)
    (road l1 l6)
    (road l6 l1)
    )
 (:goal  (and 
    (at p1 l6)
    (at p2 l9)
    (at p3 l9)
    (at p4 l1)
    (at p5 l8)
    (at p6 l3)
    (at p7 l5)
    (at p8 l5))))

; plan
1. (pickup v1 l3 p1 c0 c1)
   deleted: (at p1 l3) (capacity v1 c1)
   added: (in p1 v1) (capacity v1 c0)
   goals met: 0 of 8
2. (drive v1 l3 l1)
   deleted: (at v1 l3)
   added: (at v1 l1)
   goals met: 0 of 8
3. (drive v1 l1 l6)
   deleted: (at v1 l1)
   added: (at v1 l6)
   goals met: 0 of 8
4. (drop v1 l6 p1 c0 c1)
   deleted: (in p1 v1) (capacity v1 c0)
   added: (at p1 l6) (capacity v1 c1)
   goals met: 1 of 8
5. (drive v1 l6 l7)
   deleted: (at v1 l6)
   added: (at v1 l7)
   goals met: 1 of 8
6. (pickup v1 l7 p2 c0 c1)
   deleted: (at p2 l7) (capacity v1 c1)
   added: (in p2 v1) (capacity v1 c0)
   goals met: 1 of 8
7. (drive v1 l7 l2)
   deleted: (at v1 l7)
   added: (at v1 l2)
   goals met: 1 of 8
8. (drive v1 l2 l9)
   deleted: (at v1 l2)
   added: (at v1 l9)
   goals met: 1 of 8
9. (drop v1 l9 p2 c0 c1)
   deleted: (in p2 v1) (capacity v1 c0)
   added: (at p2 l9) (capacity v1 c1)
   goals met: 2 of 8
10. (drive v1 l9 l2)
   deleted: (at v1 l9)
   added: (at v1 l2)
   goals met: 2 of 8
11. (drive v1 l2 l6)
   deleted: (at v1 l2)
   added: (at v1 l6)
   goals met: 2 of 8
12. (pickup v1 l6 p3 c0 c1)
   deleted: (at p3 l6) (capacity v1 c1)
   added: (in p3 v1) (capacity v1 c0)
   goals met: 2 of 8
13. (drive v1 l6 l2)
   deleted: (at v1 l6)
   added: (at v1 l2)
   goals met: 2 of 8
14. (drive v1 l2 l9)
   deleted: (at v1 l2)
   added: (at v1 l9)
   goals met: 2 of 8
15. (drop v1 l9 p3 c0 c1)
   deleted: (in p3 v1) (capacity v1 c0)
   added: (at p3 l9) (capacity v1 c1)
   goals met: 3 of 8
16. (drive v1 l9 l1)
   deleted: (at v1 l9)
   added: (at v1 l1)
   goals met: 3 of 8
17. (drive v1 l1 l4)
   deleted: (at v1 l1)
   added: (at v1 l4)
   goals met: 3 of 8
18. (pickup v1 l4 p4 c0 c1)
   deleted: (at p4 l4) (capacity v1 c1)
   added: (in p4 v1) (capacity v1 c0)
   goals met: 3 of 8
19. (drive v1 l4 l1)
   deleted: (at v1 l4)
   added: (at v1 l1)
   goals met: 3 of 8
20. (drop v1 l1 p4 c0 c1)
   deleted: (in p4 v1) (capacity v1 c0)
   added: (at p4 l1) (capacity v1 c1)
   goals met: 4 of 8
21. (drive v1 l1 l5)
   deleted: (at v1 l1)
   added: (at v1 l5)
   goals met: 4 of 8
22. (pickup v1 l5 p5 c0 c1)
   deleted: (at p5 l5) (capacity v1 c1)
   added: (in p5 v1) (capacity v1 c0)
   goals met: 4 of 8
23. (drive v1 l5 l4)
   deleted: (at v1 l5)
   added: (at v1 l4)
   goals met: 4 of 8
24. (drive v1 l4 l8)
   deleted: (at v1 l4)
   added: (at v1 l8)
   goals met: 4 of 8
25. (drop v1 l8 p5 c0 c1)
   deleted: (in p5 v1) (capacity v1 c0)
   added: (at p5 l8) (capacity v1 c1)
   goals met: 5 of 8
26. (drive v1 l8 l2)
   deleted: (at v1 l8)
   added: (at v1 l2)
   goals met: 5 of 8
27. (drive v1 l2 l6)
   deleted: (at v1 l2)
   added: (at v1 l6)
   goals met: 5 of 8
28. (pickup v1 l6 p6 c0 c1)
   deleted: (at p6 l6) (capacity v1 c1)
   added: (in p6 v1) (capacity v1 c0)
   goals met: 5 of 8
29. (drive v1 l6 l2)
   deleted: (at v1 l6)
   added: (at v1 l2)
   goals met: 5 of 8
30. (drive v1 l2 l3)
   deleted: (at v1 l2)
   added: (at v1 l3)
   goals met: 5 of 8
31. (drop v1 l3 p6 c0 c1)
   deleted: (in p6 v1) (capacity v1 c0)
   added: (at p6 l3) (capacity v1 c1)
   goals met: 6 of 8
32. (drive v1 l3 l2)
   deleted: (at v1 l3)
   added: (at v1 l2)
   goals met: 6 of 8
33. (pickup v1 l2 p7 c0 c1)
   deleted: (at p7 l2) (capacity v1 c1)
   added: (in p7 v1) (capacity v1 c0)
   goals met: 6 of 8
34. (drive v1 l2 l3)
   deleted: (at v1 l2)
   added: (at v1 l3)
   goals met: 6 of 8
35. (drive v1 l3 l5)
   deleted: (at v1 l3)
   added: (at v1 l5)
   goals met: 6 of 8
36. (drop v1 l5 p7 c0 c1)
   deleted: (in p7 v1) (capacity v1 c0)
   added: (at p7 l5) (capacity v1 c1)
   goals met: 7 of 8
37. (drive v1 l5 l10)
   deleted: (at v1 l5)
   added: (at v1 l10)
   goals met: 7 of 8
38. (pickup v1 l10 p8 c0 c1)
   deleted: (at p8 l10) (capacity v1 c1)
   added: (in p8 v1) (capacity v1 c0)
   goals met: 7 of 8
39. (drive v1 l10 l5)
   deleted: (at v1 l10)
   added: (at v1 l5)
   goals met: 7 of 8
40. (drop v1 l5 p8 c0 c1)
   deleted: (in p8 v1) (capacity v1 c0)
   added: (at p8 l5) (capacity v1 c1)
   goals met: 8 of 8
